In [6]:
import pandas as pd
import numpy as np

In [12]:
data = {
    "nome":["Teo", "Nah", "Lah", "Mah", "Jo"],
    "idade":[31, 32, 34, 12, np.nan],
    "renda":[np.nan, 3245, 357, 12432, np.nan],
}

In [16]:
df = pd.DataFrame(data)
df

  nome  idade    renda
0  Teo   31.0      NaN
1  Nah   32.0   3245.0
2  Lah   34.0    357.0
3  Mah   12.0  12432.0
4   Jo    NaN      NaN

In [20]:
df["idade"].isna().sum()

1

In [22]:
df.isna().sum()

nome     0
idade    1
renda    2
dtype: int64

In [24]:
df.isna().mean()

nome     0.0
idade    0.2
renda    0.4
dtype: float64

In [28]:
df.fillna({"idade": df["idade"].mean(),
           "renda": df["renda"].mean(),
          })

  nome  idade         renda
0  Teo  31.00   5344.666667
1  Nah  32.00   3245.000000
2  Lah  34.00    357.000000
3  Mah  12.00  12432.000000
4   Jo  27.25   5344.666667

In [34]:
df.dropna(subset =["idade", "renda"], how='all')

  nome  idade    renda
0  Teo   31.0      NaN
1  Nah   32.0   3245.0
2  Lah   34.0    357.0
3  Mah   12.0  12432.0

In [40]:
df.dropna(axis=1, how='any')

  nome
0  Teo
1  Nah
2  Lah
3  Mah
4   Jo